-- # Answer.DataStructures.Ex0314
-- ## 練習問題 3.14
-- `(++) :: [a] -> [a] -> [a]`を`foldr`あるいは`foldl'`のいずれかで実装せよ。
{-# LANGUAGE GHC2024 #-}
module Answer.DataStructures.Ex0314
    ( 
    ) where

-- | `(++?)`
-- `(++)`は標準プレリュード関数である。
-- 衝突を回避するために、ここでは
-- 直接再帰では以下のように定義する
-- ```haskell
-- (++?) :: [a] -> [a] -> [a]
-- []   ++? ys = ys
-- x:xs ++? ys = x : (xs ++? ys)
-- ```
-- したがって、`foldr`で定義する。
--
-- >>> (++?) :: [a] -> [a] -> [a]; xs ++? ys = foldr (:) ys xs
-- >>> [1 .. 100] ++? [101 .. 201] == [1 .. 100] ++ [101 .. 201]
-- True
--
